IDEA Open Model
ConcreteBlockData Properties
The ConcreteBlockData type exposes the following members.
Properties
Name | Description
AxisX
 LCS - Axis X
AxisY
 LCS - Axis Y
AxisZ
 LCS - Axis Z
Center
 Center of the concrete block LCS
Depth
 Depth of the concrete block
Id
 Plate unique ID
Material
 Name of the material
Name
 Name of the concrete block
Origin
 Origin of the concrete block LCS
OriginalModelId
 Get or set the identification in the original model In the case of the imported connection from another application
OutlinePoints
 Outline points
Region
 Geometry of the concrete block in svg format
Top
See Also
Reference
ConcreteBlockData Class
IdeaRS.OpenModel.Connection Namespace